//2252429蔡宇轩
`timescale 1ns / 1ps
//cpu31后仿真测试模块
module cpu31_tb();
//---------------------------------------------------------------   
    //定义内部变量
    reg clk;                    //时钟信号
    reg rst;                    //复位信号
    wire [31:0] inst;           //执行的指令
    wire [31:0] pc;             //下一条指令的地址
//---------------------------------------------------------------   
//cpu实例化
sccomp_dataflow cpu31_inst(
    .clk_in(clk),
    .reset(rst),
    .inst(inst),
    .pc(pc)
);
//---------------------------------------------------------------   
initial 
    begin
    clk = 0;
    rst = 1;
    //wait for gloabal rest to finish
    #50
    rst = 0;
    end
//---------------------------------------------------------------   
//设置时钟
    always #50 clk =~clk;
//---------------------------------------------------------------   
endmodule
